public class GLOBAL
{
    //глобальный пользователь, который авторизовался
    public static User user = new User();
    
    //используемые константы
    public static String TITLE = "Exam Controller"; //название программы, используется в заголовке окна
    public static String DBURL = "//localhost/sessia"; //адрес подключения к БД
    public static String ICONURL = "/icon.png"; //местоположение иконки приложения
}
//на экране администратора БД (и у обычного пользователя) запись удалена появляется даже когда элементы не выбраны, но кнопка нажата

//верни считывание IP-адреса из файла!

//добавить администратору БД возможность принудительно удалять экзамен и оценки

//при выставлении зач/незач появляются оценки

//переместить цвета и строки в константы